// 试题描述
//    使用指针的方法，将一个整数插入到由小到大排列的数列中，使得插入后仍然保持由小到大的顺序。
// 输入
//    输入包含两行：
//    第一行是10个由小到大排好序的整数，邻近两数之间用一个空格隔开。
//    第二行是需要插入的新整数m。
// 输出
//    输出插入数字后，由小到大排好序的11个整数，邻近两数之间用一个空格隔开。
// 输入示例
//    5 7 9 11 25 28 30 31 32 33
//    7
// 输出示例
//    5 7 7 9 11 25 28 30 31 32 33
// 数据范围
//    输入和输出均为int范围的整数

#include <stdio.h>
int main()
{
    int a[11];
    int i, x, y, num1 = 0, num2;
    int *p;
    for (i = 0; i < 10; i++)
    {
        scanf("%d ", &a[i]);
    }
    scanf("%d", &x);
    p = &x;
    if (*p >= a[9])
    {
        for (i = 0; i < 10; i++)
        {
            printf("%d ", a[i]);
        }
        printf("%d", *p);
    }
    if (*p < a[9])
    {
        for (i = 0; a[i]; i++)
        {
            if (a[i] >= *p)
            {
                y = i;
                num1 = a[i];
                a[i] = *p;
                break;
            }
        }
        for (y = i; y < 11; y++)
        {
            num2 = a[y + 1];
            a[y + 1] = num1;
            num1 = num2;
        }
        for (i = 0; i < 11; i++)
        {
            printf("%d ", a[i]);
        }
    }
}