// 试题描述
//    定义一维整型数组x，并输入数组元素个数N。要求使用指针运算的方法遍历数组并对数组各个元素进行赋值及输出操作。
//    要求使用如下公式给数组各个元素赋值：
//    x[i] = 600 * cos(i * 0.35)
// 输入
//    输入一个整数N（0 < N < 1000）。
// 输出
//    逐个输出数组中的N个元素，邻近两数之间用一个空格隔开。
// 输入示例
//    5
// 输出示例
//    600 563 458 298 101
// 数据范围
//    输入和输出均为int范围的整数，对于100%的数据，0 < N < 1000

#include <stdio.h>
#include <math.h>
void main()
{
    int i, n, m;
    int a[1000];
    int *pa;
    pa = a;
    scanf("%d", &n);
    for (i = 0; i < n; i++)
    {
        a[i] = i;
    }
    for (i = 0; i < n; i++)
    {
        m = 600 * cos(*(pa + i) * 0.35);
        printf("%d ", m);
    }
}
