// 试题描述
//    由键盘上输入1个三位正整数n。魔镜把三个数字的排列次序打乱重新组合一个新的三位正整数，使其值最大。请你帮助魔镜输出该值。
// 输入
//    输入一个正整数n，且100 <= n <= 999。
// 输出
//    按照题目要求输出。
// 输入示例
//    296
// 输出示例
//    962
// 数据范围
//    对于100%的数据，100 <= n <= 999

#include<stdio.h>
int main()
{
    int m,t,r;
    int a,b,c;
    scanf("%d",&m);
    a=m/100;
    b=m/10%10;
    c=m%10;
    if ( a < b )
    {
        t = a;
        a = b;
        b = t;
    }
    if( a < c )
    {
        t = a;
        a = c;
        c = t;
    }
    if( b < c )
    {
        t = b;
        b = c;
        c = t; 
    }
    r=a*100+b*10+c;
    printf("%d",r);
    return 0;
}
