// 输出斐波那契数列前二十项
// #include<stdio.h>
// int main()
// {
// 	int i;
// 	int f[20]={1,1};             //注意此处用数组定义前两个数为1，1
// 	for ( i = 2; i < 20; i++)    //此处就是因为之前使用了数组所以可以直接来使用斐波那契数列公式
// 	{
// 		f[i]=f[i-1]+f[i-2];
// 	}
// 	for ( i = 0; i < 20; i++)
// 	{
// 		if (i%5==0)              //此处是指可以每五个为一行输出
// 		{
// 			printf("\n");
// 		}
// 		printf("%-14d",f[i]);
// 	}
// 	return 0;
// }

// 冒泡法比较数组内的数字(9个数字)
// ：(主要部分)
// for (i = 0; i < 9; i++)           //进行9次循环，实现9轮比较
// {
//     for (j = 0; j < 9 - i; j++)   //在每轮比较进行9-i次循环
//     {
//         if (a[j] > a[j + 1])
//         {
//             temp = a[j];
//             a[j] = a[j + 1];
//             a[j + 1] = temp;
//         }
//     }
// }

// 找出3 * 4二维数组中最大值并找出其行和列： max = a[0][0];
// row = 0;                               //定义行值
// column = 0;                            //定义列值
// for (i = 0; i < 3; i++)
// {
//     for (j = 0; j < 4; j++)
//     {
//         if (max < a[i][j])             //找最大值
//         {
//             max = a[i][j];
//             row = i;                   //用这种方法很容易直接找到行列值
//             column = j;
//         }
//     }
// }



// 转置矩阵：
// for (i = 0; i < 3; i++)
// {
//     for (j = 0; j < 3; j++)
//     {
//         b[i][j] = a[j][i]
//     }
// }






